["Best features of Docker:\n\n- Easy to get a project to the top of HackerNews\n- New Github stars for old ideas\n- Has lots of Twitter followers", "RT @honest_update: Good thing we host in the cloud because I'd just burn these servers to the ground if I could get to them.", "RT @honest_update: Currently browsing StackOverflow with the text from the error we're seeing.", "When all you have is a hammer, everything starts to look like a monad.", "One of our engineers just said he wants us to build a SOAP API next.\n\nUPDATE:  One of our former engineers.", "Just finished rewriting all my ember apps on backbone, and now I get to rewrite them all on angular.  Feels good to make progress!", "People who use Android.\n\nType 1:  Idiots.\nType 2:  People who are insufferably anti-Apple and won't stop telling you about it.", "Software is over.  Everyone who's anyone has moved on to hardware hacking.", "I already built Atom as an Emacs extension in 1994.", "I like my web frameworks how I like my brews:  micro.", "Whenever I find myself using apt-get or yum, I reimplement the whole thing in node so I can use npm.", "I'm rewriting git in Javascript.", "Works fine for me locally.  Sounds like an ops problem.  I'm going to lunch.", "It doesn't matter what problem I'm solving:  I'll find a way to use node and redis to solve it!", "PHP = PreHistoric Programming", "I don't know what I'm writing yet, but I know it's going to compile to Javascript.", "I don't need tests:  tests are for people who write bugs.", "Writing this tweet from Vim inside docker inside vagrant on my pre-release iPad Air.", "I just had a recruiter contact me because I'm \"experienced in GitHub and other object-oriented programming languages.\"", "Writing good code in PHP is like picking up a rusty ukulele and trying to make a decent song on it.", "If your boss won't let you write everything in Go, stop.", "I've got Postgres on vinyl.", "RT @NeckbeardHacker: 2003: \"I replaced you with a set of very small shell scripts.\"\n2013: \"I replaced your scripts with a six-figure enterp…", "Private Cloud is a just another way of saying \"our shitty intranet\"", "I heard jQuery launched a credit card called \"technical debt\".", "I hate that old adage that says everyone is a liberal in their 20s, but everyone grows up and uses Java by their 40s.", "Sublime Text is even cooler than ultralight bicycles.", "Feels like all the functional language programmers come from more functional countries than the USA:\n\nFinland, Netherlands, Sweden, Oregon..", "\"What kind of meat comes on the Functional Object Burger?\"\n\n\"Lamb, duh.\"", "There is zero overlap between developers who prefer IPAs and developers who prefer IDEs.", "I tried to get my python Googler friends to stop talking about tuples, but it turns out they're the immutable type.", "Erlang is better than yer lang.", "Hoping Google will announce Google+ was just a long, elaborate, sad April Fools joke.", "Done being a programmer.  From now on I want to be called a Data Scientist.", "No, I'm not going to #SXSW.  In related news, it's not 2004.", "I can't believe your Caps Lock key hasn't been remapped yet.", "I was surprised this developer had an Android phone, but that was before I saw his Velcro sandals and cargo shorts.", "CoffeeScript makes it infuriatingly difficult to find which line has a bug, and dangerously easy to hire the kinds of people who write bugs.", "Anything not written on @meteorJS is henceforth known as \"legacy code\".", "If I discover even ONE tab character in your codebase, my contract rate just doubled.", "Nothing but Lisp in my text editor, nothing but vinyl in my ears.", "I wrote that in Python because Ruby has jumped the shark.", "There are only two options if you want me keep working on your stupid project:  either let me use more APIs, or let me drink more IPAs.", "Would you bet on a NASCAR driver who can't drive stick?\n\nNo?\n\nThen fire every developer who doesn't use Vim or Emacs.", "In 2013 I'm moving to Portland, so I can raise my own chickens and manage my own memory.", "My company's CTO just told me we need to support more browsers than just Chrome.  I put in my two weeks notice.", "Let me save everyone some time:  No matter WHAT database question you ask me, I'm just going to tell you that you should be using Postgres.", "When someone says they like static typing and database schemas, I just assume they're being ironic.", "They say the dream of the 90's is alive in Portland, but I haven't met a single Java developer here.", "To save time, I just set up an auto-reply for recruiters on LinkedIn:  \"Is the company based in the Mission?\"", "Dart has all of the best Java idioms, such as copying and pasting identical interface implementations all over the place & burying the diffs", "Getting hired at an Oracle shop is like going to an open bar party where the only beer is Heineken.", "jQuery is the PHP4 of Javascript", "I preferred Google+ when it was called \"Diaspora\"", "Google+ is the Sega Dreamcast of web products:  it won't be cool until you happen across it at a garage sale a decade from now.", "The only way to tell the difference between an elite developer and a homeless person is his iPhone.  The homeless guy probably has Android.", "When you say \"I write enterprise software\", all I hear is \"I write bad software\".", "Lost half my freelance clients when I announced I would only be accepting payment in BitCoins.  The lame half.", "Wondering if Google will announce anything as important and world-changing as Wave this year.", "Microsoft paid $8.5 billion just to get people to install Silverlight.", "Java is the pleated khakis of the software world.", "I'm debating between developing for the BlackBerry PlayBook and developing for the Sega Genesis.", "If it's not MongoDB, it's the WrongoDB.", "Netflix is the only reason to install Silverlight.  Minecraft the only reason to install the JVM.", "If someone makes an Android app in the forest, does anybody care?", "\"The Cloud\" is something idiots call what the rest of us call \"The Internet\"", "RT @DarkMalloc: You guys really should follow @hipsterhacker :)", "I don't know if anyone else has realized this, but if you switch to Node, your backend and frontend will be written in the same language.", "Android is like the Windows of smartphones.  (It's not Windows Mobile: Windows Mobile is like the Denny's of smartphones.)", "For angel investors:  A startup's value is inversely proportional to the # of people wearing business casual.", "There are two kinds of people in the world:  people who say \"ping\" when they mean \"instant message\", and people who understand computers.", "RT @tenderlove: @dorkitude @hipsterhacker parody?", "RT @zedshaw: HA! @hipsterhacker is both pretty funny and damn accurate.", "RT @rmurphey: Pretty sure @hipsterhacker is my favorite fake person on twitter.", "SQL is like inline CSS, food stamps, and hentai. Just because you loved it as a kid doesn't mean you should still be using it as a grown-up.", "Honestly, if you're using SVN or Perforce, why are you trying to hire 'the best' freelancers? You clearly don't employ the best full-timers.", "So Lisp and the JVM were having one of those post-breakup beers that always turns into a fight. Then they decided they needed some Clojure.", "Common Lisp is making a comeback like bellbottoms, pubic hair, and the unholy alliance of mustaches and androgyny.", "I'm making a KILLING as a webscale freelancer in 2011. First, I replace a client's Drupal site with Rails+NoSQL. Then, I sell them support.", "Android's spellchecker doesn't know the word \"quinoa\", but iPhone's does.  I'm guessing the same can be said for their respective users.", "I was just offered $90/hour to do Java/Android dev. I turned it down because someone else offered me $60/hour to gouge out my own eyeballs.", "I just got asked if I wanted to design/build a new Rails app for some startup. Had to check my calendar to confirm it's not, in fact, 2008.", "RT @mperham: I love that @hipsterhacker is tweeting from Ritual Roasters in the Mission.  That's hardcore satire.", "Tests are mostly popular among people who write a lot of bugs; condoms are mostly popular among people who consort with the diseased.", "I just overheard one guy in flannel asking another guy in flannel for some PHP advice. My advice? Stop using PHP, or stop wearing flannel.", "It's really hard to take these coders seriously when I see them coding ruby in Eclipse. If you're not using vim, don't talk to me.", "Seeking junior web developer. Must be  willing to inherit whatever tech stack has lost my favor this month, while I convert to the new one.", "Only old people need money to get a startup going.  Venture capital? More like denture capital.", "Choosing a web framework is like choosing a brew of beer: if it's not \"micro\", you don't know what the hell you're talking about.", "Will someone please tell my iPhone that \"its\" is a real fucking word? I'm tired of this thing making me look like I write for TechCrunch.", "Doing web development with anything not called #nodeJS feels like going back home to the midwest and being force-fed trans fats.", "I write world-changing applications in languages you have probably not yet heard of.  My code is poetry, meanwhile yours is oh-noetry."]